In [169]:
import pandas as pd
df=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8],"C":[9,10,12,13]})
df

df.to_csv("Test1.csv",index=False)

In [179]:
csv=pd.read_csv("C:\\Users\\HP\\Desktop\\Pandas\\Test1.csv")
csv

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  12
3  4  8  13

In [186]:
csv=pd.read_csv("C:\\Users\\HP\\Desktop\\Pandas\\Test1.csv",nrows=1)
csv

   A  B  C
0  1  5  9

In [194]:
csv=pd.read_csv("C:\\Users\\HP\\Desktop\\Pandas\\Test1.csv",usecols=[0,1])
csv

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [198]:
csv=pd.read_csv("C:\\Users\\HP\\Desktop\\Pandas\\Test1.csv",skiprows=[0,2])
csv

   1  5   9
0  3  7  12
1  4  8  13

In [200]:
csv=pd.read_csv("C:\\Users\\HP\\Desktop\\Pandas\\Test1.csv",index_col=["A"])
csv

   B   C
A
1  5   9
2  6  10
3  7  12
4  8  13

In [202]:
csv=pd.read_csv("C:\\Users\\HP\\Desktop\\Pandas\\Test1.csv",header=1)
csv

   1  5   9
0  2  6  10
1  3  7  12
2  4  8  13

In [224]:
csv=pd.read_csv("C:\\Users\\HP\\Desktop\\Pandas\\Test1.csv",dtype={"C":"float"})
csv

   A  B     C
0  1  5   9.0
1  2  6  10.0
2  3  7  12.0
3  4  8  13.0